#pragma once
#ifndef OUTPUT_H_
#define OUTPUT_H_


//输出航班时刻表题头
void flight_info_title(void)
{
	printf("-----------------------------------------------------------------------------------------------------\n");
	printf("                                            航 班 时 刻 表\n");
}

//输出航班预定管理系统题头
void FRMS_title(void)
{
	printf("-----------------------------------------------------------------------------------------------------\n\n");
	printf("                      航      班      预      定      管      理      系      统\n\n");
}

//输出航班时刻表分类栏
void flight_info_subtitle(void)
{
	printf("-----------------------------------------------------------------------------------------------------\n");
	printf("|No|%20s|%20s|%12s|%7s|%8s|%8s|%8s|%6s|\n", "始发地", "目的地", "航空公司", "航班号", "起飞时间", "到达时间", "航班人数", "票价");
}

#endif
